TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.h
/**
 *******************************************************************************
 * @file    STM32_LORAE5.h
 * @author  manu
 * @brief   Driver AT-command pour module LoRa-E5 (Wio-E5 / STM32WLE5)
 *          via UART + DMA circulaire RX.
 * @version 1.0.0
 * @date    2026-02-26
 * @copyright Libre sous licence MIT.
 * @note    Délais bloquants : aucun — toutes les opérations sont non-bloquantes.
 *          Les timeouts applicatifs sont gérés dans LORAE5_Task() via HAL_GetTick().
 * @note    Compatibilité RTOS : oui (HAL_GetTick() ou osKernelGetTickCount()),
 *          Init() depuis une tâche init uniquement, jamais depuis IRQ.
 * @note    sizeof(LORAE5_Handle_t) ≈ 700 octets (dépend de LORAE5_RX_LINE_MAX /
 *          LORAE5_TX_BUF_MAX définis dans STM32_LORAE5_conf.h).
 * @warning Modèle thread unique : LORAE5_Task / LORAE5_PopLine depuis main uniquement.
 *          LORAE5_OnRxEvent / LORAE5_OnTxCplt depuis IRQ uniquement.
 *******************************************************************************
 */
#ifndef STM32_LORAE5_H
#define STM32_LORAE5_H

#ifdef __cplusplus
extern "C" {
#endif

/* ============================================================================
 * Includes
 * ============================================================================ */
#include "main.h"
#include "STM32_LORAE5_conf.h"
#include LORAE5_HAL_HEADER     ///< HAL multi-famille STM32 via CubeMX (UART_HandleTypeDef, HAL_GetTick…)
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

/* ============================================================================
 * Exported constants
 * ============================================================================ */

/** @brief Version majeure de la librairie STM32_LORAE5. */
#define LORAE5_LIB_VERSION_MAJOR  1U  ///< Majeur : incrémenté sur rupture d'API
/** @brief Version mineure de la librairie STM32_LORAE5. */
#define LORAE5_LIB_VERSION_MINOR  0U  ///< Mineur : incrémenté sur fonctionnalité compatible
/** @brief Version patch de la librairie STM32_LORAE5. */
#define LORAE5_LIB_VERSION_PATCH  0U  ///< Patch : corrections rétrocompatibles

/* ============================================================================
 * Exported types
 * ============================================================================ */

/**
 * @brief Codes de retour de la librairie STM32_LORAE5.
 */
typedef enum {
  LORAE5_OK           = 0,  ///< Opération réussie
  LORAE5_ERR_NULL_PTR,          ///< Pointeur NULL non autorisé
  LORAE5_ERR_BUSY,          ///< Module TX occupé (réessayer)
  LORAE5_ERR_UART,          ///< Erreur HAL UART (TX ou RX)
  LORAE5_ERR_ARG,           ///< Argument invalide (longueur, format)
  LORAE5_ERR_TIMEOUT,       ///< Délai dépassé — réservé à l'applicatif (lib FSM async, jamais de boucle bloquante)
  LORAE5_ERR_OVERFLOW       ///< Buffer RX débordement ligne trop longue
} LORAE5_Status;

/**
 * @brief Modes LoRaWAN supportés par la commande AT+MODE.
 */
typedef enum {
  LORAE5_MODE_LWOTAA = 0,  ///< LoRaWAN Over-The-Air Activation (OTAA)
  LORAE5_MODE_LWABP,       ///< LoRaWAN Activation By Personalization (ABP)
  LORAE5_MODE_TEST         ///< Mode test RF (émission/réception directe)
} LORAE5_Mode;

/**
 * @brief Prototype de callback ligne reçue.
 * @note  ⚠️ Appelé depuis le contexte ISR/DMA (LORAE5_OnRxEvent).
 *        NE PAS faire de printf, malloc, ou opérations bloquantes.
 *        Utiliser LORAE5_PopLine() depuis main pour un usage sûr.
 */
typedef void (*LORAE5_LineCallback)(const char *line, void *user_ctx);

/**
 * @brief Handle principal du driver STM32_LORAE5.
 *
 * Encapsule l'état UART, DMA et la machine d'état LoRaWAN OTAA.
 * Toute instance est indépendante (multi-instance supporté).
 *
 * @warning Usage thread unique. LORAE5_Task/PopLine depuis main,
 *          LORAE5_OnRxEvent/OnTxCplt depuis IRQ uniquement.
 * @note    sizeof(LORAE5_Handle_t) ≈ 700 octets (cf. @file).
 */
typedef struct {
  /* ── Bus UART + DMA RX ─────────────────────────────────────────────────── */
  UART_HandleTypeDef *huart;         ///< Handle UART HAL (non NULL après Init)
  uint8_t tx_buf[LORAE5_TX_BUF_MAX]; ///< Buffer TX persistant (DMA-safe, dans le handle)
  uint8_t *rx_dma;                   ///< Buffer DMA RX circulaire (fourni par l'utilisateur)
  uint16_t rx_dma_size;              ///< Taille du buffer DMA RX en octets
  uint16_t rx_last_pos;              ///< Position courante dans le buffer DMA RX

  /* ── Assemblage ligne RX ───────────────────────────────────────────────── */
  char line_buf[LORAE5_RX_LINE_MAX]; ///< Buffer d'assemblage ligne en cours (ISR)
  uint16_t line_len;                 ///< Longueur courante de la ligne en cours
  volatile bool line_overflow;       ///< Ligne trop longue (> LORAE5_RX_LINE_MAX - 1)

  /* ── Synchronisation TX ────────────────────────────────────────────────── */
  volatile bool tx_busy;             ///< true si une transmission DMA/IT est en cours

  /* ── Événements join LoRaWAN ───────────────────────────────────────────── */
  volatile bool joined;              ///< true si le module a rejoint le réseau
  volatile bool evt_join_ok;         ///< Événement join réussi (consommer via ConsumeJoinOkEvent)
  volatile bool evt_join_fail;       ///< Événement join échoué (consommer via ConsumeJoinFailEvent)

  /* ── Événements downlink LoRaWAN ─────────────────────────────────────── */
  volatile bool evt_downlink;              ///< true si un downlink a été reçu (consommer via ConsumeDownlinkEvent)
  uint8_t downlink_port;                   ///< Port applicatif du dernier downlink (1..223)
  char downlink_data[LORAE5_RX_LINE_MAX];  ///< Payload du downlink (ASCII ou hex string selon +MSG/+MSGHEX)
  bool downlink_is_hex;                    ///< true si le downlink provient d'un +MSGHEX: (payload hex)

  /* ── Publication lignes RX vers main ───────────────────────────────────── */
  volatile bool line_ready;          ///< Compatibilité : true si la file RX contient au moins une ligne
  char line_last[LORAE5_RX_LINE_MAX]; ///< Dernière ligne complète reçue (terminée par '\0')
  volatile uint16_t line_q_head;     ///< Index d'écriture de la file de lignes RX
  volatile uint16_t line_q_tail;     ///< Index de lecture de la file de lignes RX
  char line_queue[LORAE5_LINE_QUEUE_DEPTH][LORAE5_RX_LINE_MAX]; ///< File circulaire de lignes RX complètes

  /* ── Machine d'état OTAA managée ──────────────────────────────────────── */
  bool managed_enabled;              ///< true si LORAE5_StartManagedOtaa* a été appelé
  const char *managed_region;        ///< Région LoRaWAN (ex : "EU868"), pointeur applicatif
  const char *managed_payload;       ///< Payload uplink périodique, pointeur applicatif
  const char *managed_dev_eui;       ///< DevEUI 16 hex chars ou NULL (clés OTAA optionnelles)
  const char *managed_app_eui;       ///< AppEUI 16 hex chars ou NULL
  const char *managed_app_key;       ///< AppKey 32 hex chars ou NULL
  uint32_t managed_uplink_period_ms; ///< Période uplink périodique en ms
  uint32_t managed_next_action_ms;   ///< Timestamp HAL_GetTick() de la prochaine action FSM
  uint32_t managed_last_uplink_ms;   ///< Timestamp HAL_GetTick() du dernier uplink envoyé
  uint32_t managed_join_deadline_ms; ///< Deadline watchdog JOIN (0 = inactif) — mis à jour par LORAE5_Task
  uint8_t managed_step;              ///< Étape courante de la FSM OTAA (0 = démarrage)

  /* ── Callback utilisateur ──────────────────────────────────────────────── */
  LORAE5_LineCallback on_line;       ///< Callback appelé à chaque ligne (depuis ISR — voir @note)
  void *on_line_ctx;                 ///< Contexte utilisateur passé à on_line

