TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.h
  /* ── Diagnostic ─────────────────────────────────────────────────────────── */
  bool initialized;                  ///< true après un appel réussi à LORAE5_Init()
  uint8_t consecutive_errors;        ///< Compteur d'erreurs UART consécutives (remis à 0 sur succès)
  LORAE5_Status last_error;          ///< Dernier code d'erreur rencontré (LORAE5_OK si aucun)
  uint8_t rx_overflow_count;         ///< Nombre de lignes perdues par overflow de queue RX (sature à 255) — lire via LORAE5_GetOverflowCount()
} LORAE5_Handle_t;

/**
 * @brief Contexte terminal AT debug (UART → LoRa-E5 bridge interactif).
 * @note  Usage optionnel — permet d'envoyer des commandes AT via UART debug.
 */
typedef struct {
  UART_HandleTypeDef *uart_debug;       ///< Handle UART debug (console série)
  LORAE5_Handle_t *lora;                  ///< Handle LoRa-E5 associé (non NULL)
  uint8_t rx_char;                      ///< Caractère reçu en réception IT (HAL_UART_Receive_IT)
  char cmd_buf[LORAE5_TERM_CMD_MAX];    ///< Buffer d'assemblage commande AT saisie
  uint16_t cmd_len;                     ///< Longueur courante de la commande en cours
  volatile bool cmd_ready;              ///< true si Enter saisi → commande prête à envoyer
  uint32_t last_input_ms;               ///< Horodatage HAL_GetTick() du dernier caractère saisi
  bool prompt_displayed;                ///< true si le prompt terminal a deja ete affiche et qu'aucune cmd n'est prete
  bool echo;                            ///< Echo local des caractères saisis
  bool show_prompt;                     ///< Afficher le prompt "> " après chaque réponse
} LORAE5_Terminal;

/* ============================================================================
 * Exported functions prototypes
 * ============================================================================ */

/* ── Lifecycle ───────────────────────────────────────────────────────────── */

/**
 * @brief  Initialise le handle STM32_LORAE5 et lie le périphérique UART.
 * @param  handle            Handle à initialiser (non NULL, alloué par l'utilisateur)
 * @param  uart              Handle UART HAL (non NULL, configuré par CubeMX)
 * @param  rx_dma_buffer     Buffer DMA circulaire RX (fourni statiquement par l'utilisateur)
 * @param  rx_dma_buffer_size Taille du buffer DMA RX en octets (> 0)
 * @retval LORAE5_OK         Initialisation réussie
 * @retval LORAE5_ERR_NULL_PTR   Paramètre NULL ou taille nulle
 * @note   Ne démarre pas la réception DMA — appeler LORAE5_StartRx() ensuite.
 * @warning Ne pas appeler depuis une IRQ.
 */
LORAE5_Status LORAE5_Init(LORAE5_Handle_t *handle,
                          UART_HandleTypeDef *huart,
                          uint8_t *rx_dma_buffer,
                          uint16_t rx_dma_buffer_size);

/**
 * @brief  Arrête le DMA RX et remet le handle à zéro.
 * @param  handle    Handle actif (non NULL)
 * @retval LORAE5_OK Succès
 * @retval LORAE5_ERR_NULL_PTR handle NULL
 */
LORAE5_Status LORAE5_DeInit(LORAE5_Handle_t *handle);

/* ── DMA RX ──────────────────────────────────────────────────────────────── */

/**
 * @brief  Démarre la réception DMA circulaire RX (HAL_UARTEx_ReceiveToIdle_DMA).
 * @param  handle    Handle initialisé (non NULL)
 * @retval LORAE5_OK Démarrage réussi
 * @retval LORAE5_ERR_NULL_PTR Paramètre NULL ou buffer DMA non configuré
 * @retval LORAE5_ERR_UART Erreur HAL lors du démarrage DMA
 * @pre    LORAE5_Init() doit avoir été appelé avec succès.
 * @post   handle->rx_last_pos == 0, DMA circulaire actif, HT interrupt désactivé.
 */
LORAE5_Status LORAE5_StartRx(LORAE5_Handle_t *handle);

/**
 * @brief  Arrête la réception DMA RX (HAL_UART_DMAStop).
 * @param  handle    Handle actif (non NULL)
 * @retval LORAE5_OK Succès
 * @retval LORAE5_ERR_NULL_PTR handle NULL
 * @retval LORAE5_ERR_UART Erreur HAL lors de l'arrêt DMA
 */
LORAE5_Status LORAE5_StopRx(LORAE5_Handle_t *handle);

/* ── Callback utilisateur ─────────────────────────────────────────────────── */

/**
 * @brief  Enregistre un callback appelé à chaque ligne RX complète.
 * @param  handle  Handle actif (ignoré si NULL)
 * @param  cb      Fonction callback (NULL pour désinscrire)
 * @param  user_ctx Contexte passé en paramètre à chaque appel
 * @note   ⚠️ Le callback est appelé depuis le contexte ISR/DMA.
 *         Ne pas faire de printf, malloc, HAL_Delay dedans.
 *         Préférer LORAE5_PopLine() depuis main pour un usage sûr.
 */
void LORAE5_SetLineCallback(LORAE5_Handle_t *handle, LORAE5_LineCallback cb, void *user_ctx);

/* ── Callbacks HAL IRQ (à appeler depuis stm32xx_it.c) ──────────────────── */

/**
 * @brief  Callback DMA RX — appeler depuis HAL_UARTEx_RxEventCallback.
 * @param  handle       Handle actif (ignoré si NULL)
 * @param  dma_position Position courante du pointeur DMA (paramètre Size HAL)
 * @pre    Appelé exclusivement depuis le contexte IRQ/DMA HAL.
 * @post   Les octets reçus sont parsés, line_ready peut devenir true.
 * @note   Gère correctement le wrap du buffer DMA circulaire.
 */
void LORAE5_OnRxEvent(LORAE5_Handle_t *handle, uint16_t dma_position);

/**
 * @brief  Callback TX complet — appeler depuis HAL_UART_TxCpltCallback.
 * @param  handle  Handle actif (ignoré si NULL)
 * @pre    Appelé exclusivement depuis le contexte IRQ HAL.
 * @post   handle->tx_busy == false.
 */
void LORAE5_OnTxCplt(LORAE5_Handle_t *handle);

/* ── Envoi AT brut ───────────────────────────────────────────────────────── */

/**
 * @brief  Envoie une chaîne brute via UART (DMA TX si disponible, sinon IT TX).
 * @param  handle  Handle actif (non NULL)
 * @param  data    Chaîne à envoyer (non NULL, non vide, longueur ≤ 65535 octets)
 * @retval LORAE5_OK        Envoi déclenché
 * @retval LORAE5_ERR_NULL_PTR  Pointeur NULL
 * @retval LORAE5_ERR_BUSY  TX précédent encore en cours (réessayer)
 * @retval LORAE5_ERR_ARG   Longueur nulle ou > 65535
 * @retval LORAE5_ERR_UART  Erreur HAL lors du déclenchement TX
 * @note   LORAE5_ERR_BUSY est une contention normale (non-bloquant) —
 *         la FSM managée retente automatiquement.
 * @warning Le buffer @p data doit rester valide jusqu'à l'appel de LORAE5_OnTxCplt()
 *          (transfert DMA asynchrone). Ne pas passer un buffer local (stack) ou temporaire.
 *          Préférer LORAE5_SendAT() qui copie dans handle->tx_buf (DMA-safe garanti).
 */
LORAE5_Status LORAE5_SendRaw(LORAE5_Handle_t *handle, const char *data);

/**
 * @brief  Formate une commande AT (ajoute "\\r\\n") et l'envoie via LORAE5_SendRaw.
 * @param  handle  Handle actif (non NULL)
 * @param  cmd     Commande AT sans terminateur (ex : "AT+VER"), non NULL
 * @retval LORAE5_OK       Envoi déclenché
 * @retval LORAE5_ERR_NULL_PTR Pointeur NULL
 * @retval LORAE5_ERR_ARG  Commande trop longue pour le buffer TX (LORAE5_TX_BUF_MAX)
 * @retval LORAE5_ERR_BUSY TX occupé (voir LORAE5_SendRaw)
 * @retval LORAE5_ERR_UART Erreur HAL
 * @note   Utilise handle->tx_buf (buffer persistant — DMA-safe).
 */
LORAE5_Status LORAE5_SendAT(LORAE5_Handle_t *handle, const char *cmd);

