TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.h
/* ── Commandes AT de base ────────────────────────────────────────────────── */

/**
 * @brief  Envoie "AT" (ping) pour vérifier la communication avec le module.
 * @param  handle  Handle actif (non NULL)
 * @retval LORAE5_Status  Voir LORAE5_SendAT()
 */
LORAE5_Status LORAE5_Ping(LORAE5_Handle_t *handle);

/**
 * @brief  Envoie "AT+RESET" pour redémarrer le module LoRa-E5.
 * @param  handle  Handle actif (non NULL)
 * @retval LORAE5_Status  Voir LORAE5_SendAT()
 * @note   Le module redémarre et émet du texte de boot sur UART (~500 ms).
 */
LORAE5_Status LORAE5_Reset(LORAE5_Handle_t *handle);

/**
 * @brief  Envoie "AT+VER" pour lire la version du firmware du module.
 * @param  handle  Handle actif (non NULL)
 * @retval LORAE5_Status  Voir LORAE5_SendAT()
 */
LORAE5_Status LORAE5_GetVersion(LORAE5_Handle_t *handle);

/**
 * @brief  Configure le mode LoRaWAN (OTAA / ABP / TEST) via AT+MODE.
 * @param  handle  Handle actif (non NULL)
 * @param  mode    Mode désiré (LORAE5_Mode)
 * @retval LORAE5_OK       Envoi déclenché
 * @retval LORAE5_ERR_ARG  Mode inconnu
 * @retval LORAE5_Status   Voir LORAE5_SendAT() pour les autres codes
 */
LORAE5_Status LORAE5_SetMode(LORAE5_Handle_t *handle, LORAE5_Mode mode);

/**
 * @brief  Configure la région LoRaWAN via AT+DR (ex : "EU868", "US915").
 * @param  handle  Handle actif (non NULL)
 * @param  region  Chaîne région conforme AT+DR (non NULL)
 * @retval LORAE5_Status  Voir LORAE5_SendAT()
 */
LORAE5_Status LORAE5_SetRegion(LORAE5_Handle_t *handle, const char *region);

/**
 * @brief  Lance la procédure Join OTAA via AT+JOIN.
 * @param  handle  Handle actif (non NULL)
 * @retval LORAE5_Status  Voir LORAE5_SendAT()
 * @note   Non-bloquant : la réponse "+JOIN: Network joined" ou "+JOIN: Join failed"
 *         arrive asynchrone. Surveiller via LORAE5_PopLine() ou evt_join_ok/fail.
 */
LORAE5_Status LORAE5_Join(LORAE5_Handle_t *handle);

/**
 * @brief  Envoie un message ASCII non-confirmé ou confirmé (AT+MSG / AT+CMSG).
 * @param  handle         Handle actif (non NULL)
 * @param  payload_ascii  Payload texte (non NULL)
 * @param  confirmed      true → AT+CMSG (ACK réseau requis), false → AT+MSG
 * @retval LORAE5_OK       Envoi déclenché
 * @retval LORAE5_ERR_NULL_PTR payload NULL
 * @retval LORAE5_Status   Voir LORAE5_SendAT()
 */
LORAE5_Status LORAE5_SendMsg(LORAE5_Handle_t *handle, const char *payload_ascii, bool confirmed);

/**
 * @brief  Envoie un payload hexadécimal (AT+MSGHEX / AT+CMSGHEX).
 * @param  handle       Handle actif (non NULL)
 * @param  payload_hex  Chaîne hexadécimale (ex : "DEADBEEF"), non NULL
 * @param  confirmed    true → AT+CMSGHEX, false → AT+MSGHEX
 * @retval LORAE5_OK       Envoi déclenché
 * @retval LORAE5_ERR_NULL_PTR payload NULL
 * @retval LORAE5_Status   Voir LORAE5_SendAT()
 */
LORAE5_Status LORAE5_SendMsgHex(LORAE5_Handle_t *handle, const char *payload_hex, bool confirmed);

/* ── Machine d'état OTAA managée ─────────────────────────────────────────── */

/**
 * @brief  Démarre la machine d'état OTAA managée (clés depuis STM32_LORAE5_conf.h).
 * @param  handle            Handle actif (non NULL)
 * @param  region            Région LoRaWAN (non NULL, ex : "EU868")
 * @param  periodic_payload  Payload uplink périodique (non NULL)
 * @param  uplink_period_ms  Période uplink en ms (> 0)
 * @param  startup_delay_ms  Délai initial avant la première action AT (ms)
 * @retval LORAE5_OK          Démarrage réussi
 * @retval LORAE5_ERR_NULL_PTR    Paramètre NULL
 * @retval LORAE5_ERR_ARG     uplink_period_ms == 0
 * @note   Les clés DevEUI/AppEUI/AppKey sont lues depuis STM32_LORAE5_conf.h
 *         (LORAE5_APP_DEV_EUI, LORAE5_APP_APP_EUI, LORAE5_APP_APP_KEY).
 * @note   Appeler LORAE5_Task() périodiquement depuis la boucle principale.
 */
LORAE5_Status LORAE5_StartManagedOtaa(LORAE5_Handle_t *handle,
                                      const char *region,
                                      const char *periodic_payload,
                                      uint32_t uplink_period_ms,
                                      uint32_t startup_delay_ms);

/**
 * @brief  Démarre la machine d'état OTAA managée avec clés explicites.
 * @param  handle            Handle actif (non NULL)
 * @param  region            Région LoRaWAN (non NULL)
 * @param  periodic_payload  Payload uplink périodique (non NULL)
 * @param  uplink_period_ms  Période uplink en ms (> 0)
 * @param  startup_delay_ms  Délai initial en ms
 * @param  dev_eui           DevEUI 16 hex chars ou NULL (utilisation de la valeur du module)
 * @param  app_eui           AppEUI 16 hex chars ou NULL
 * @param  app_key           AppKey 32 hex chars ou NULL
 * @retval LORAE5_OK          Démarrage réussi
 * @retval LORAE5_ERR_NULL_PTR    Paramètre obligatoire NULL
 * @retval LORAE5_ERR_ARG     Format clé invalide ou uplink_period_ms == 0
 * @note   Appeler LORAE5_Task() périodiquement depuis la boucle principale.
 */
LORAE5_Status LORAE5_StartManagedOtaaWithKeys(LORAE5_Handle_t *handle,
                                              const char *region,
                                              const char *periodic_payload,
                                              uint32_t uplink_period_ms,
                                              uint32_t startup_delay_ms,
                                              const char *dev_eui,
                                              const char *app_eui,
                                              const char *app_key);

/**
 * @brief  Avance la machine d'état OTAA managée — appeler depuis while(1).
 * @param  handle  Handle actif (ignoré si NULL ou managed_enabled == false)
 * @param  now_ms  Valeur courante de HAL_GetTick()
 * @pre    LORAE5_StartManagedOtaa* doit avoir été appelé.
 * @pre    now_ms doit être HAL_GetTick() (monotone, non réinitialisé).
 * @note   Non-bloquant. Gère automatiquement : ping, version, mode, région,
 *         injection des clés (si fournies), join, uplink périodique et retry.
 * @note   Timer anti-wraparound : utilise `(int32_t)(now_ms - target) >= 0`.
 */
void LORAE5_Task(LORAE5_Handle_t *handle, uint32_t now_ms);

/**
 * @brief  Dépile une ligne RX depuis le buffer partagé (section critique interne).
 * @param  handle    Handle actif (non NULL)
 * @param  out       Buffer destination (non NULL, taille out_size)
 * @param  out_size  Taille du buffer destination (> 0)
 * @retval true  Une ligne a été copiée dans out
 * @retval false Aucune ligne disponible ou paramètre invalide
 * @note   Appeler en boucle jusqu'à retour false pour vider toutes les lignes en attente.
 */
bool LORAE5_PopLine(LORAE5_Handle_t *handle, char *out, size_t out_size);

/**
 * @brief  Consomme l'événement "join réussi" (atomique).
 * @param  handle  Handle actif (non NULL)
 * @retval true   Événement présent (evt_join_ok remis à false)
 * @retval false  Pas d'événement ou handle NULL
 */
bool LORAE5_ConsumeJoinOkEvent(LORAE5_Handle_t *handle);

/**
 * @brief  Consomme l'événement "join échoué" (atomique).
 * @param  handle  Handle actif (non NULL)
 * @retval true   Événement présent (evt_join_fail remis à false)
 * @retval false  Pas d'événement ou handle NULL
 */
bool LORAE5_ConsumeJoinFailEvent(LORAE5_Handle_t *handle);

/**
 * @brief  Consomme l'événement "downlink reçu" (atomique).
 * @details Détecté automatiquement dans les réponses AT :
 *          - @c +MSG: PORT: X; RX: "payload"   (AT+MSG / AT+CMSG)
 *          - @c +MSGHEX: PORT: X; RX: "DEADBEEF" (AT+MSGHEX / AT+CMSGHEX)
 * @param  handle        Handle actif (non NULL)
 * @param  port_out      Port applicatif du downlink [1..223] — peut être NULL
 * @param  data_out      Buffer destination pour le payload (peut être NULL)
 * @param  data_out_size Taille du buffer @p data_out
 * @param  is_hex_out    true si le payload est une chaîne hex (+MSGHEX:) — peut être NULL
 * @retval true   Événement présent (evt_downlink remis à false)
 * @retval false  Pas d'événement ou handle NULL
 * @note   Usage type :
 *         @code
 *         uint8_t port; char data[64]; bool hex;
 *         if (LORAE5_ConsumeDownlinkEvent(&lora, &port, data, sizeof(data), &hex)) {
 *             printf("DL port=%u  %s\r\n", port, data);
 *         }
 *         @endcode
 */
bool LORAE5_ConsumeDownlinkEvent(LORAE5_Handle_t *handle,
                                 uint8_t *port_out,
                                 char *data_out, size_t data_out_size,
                                 bool *is_hex_out);

/**
 * @brief  Retourne l'état de connexion LoRaWAN.
 * @param  handle  Handle (NULL → retourne false)
 * @retval true   Module joint au réseau LoRaWAN
 * @retval false  Non joint ou handle NULL
 */
bool LORAE5_IsJoined(const LORAE5_Handle_t *handle);

