TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.h
/* ── Terminal AT debug ────────────────────────────────────────────────────── */

/**
 * @brief  Initialise le terminal AT debug (bridge UART debug ↔ LoRa-E5).
 * @param  term        Contexte terminal (non NULL, alloué statiquement)
 * @param  uart_debug  Handle UART console debug (non NULL)
 * @param  lora        Handle LoRa-E5 actif (non NULL)
 * @param  echo        true → écho local des caractères saisis
 * @param  show_prompt true → affiche "> " après chaque réponse
 * @retval LORAE5_OK       Initialisation réussie
 * @retval LORAE5_ERR_NULL_PTR Paramètre NULL
 * @retval LORAE5_ERR_UART Erreur HAL démarrage IT
 * @note   Lance HAL_UART_Receive_IT sur uart_debug (1 octet par IT).
 */
LORAE5_Status LORAE5_TerminalBegin(LORAE5_Terminal *term,
                                   UART_HandleTypeDef *uart_debug,
                                   LORAE5_Handle_t *lora,
                                   bool echo,
                                   bool show_prompt);

/**
 * @brief  Callback UART IT debug — appeler depuis HAL_UART_RxCpltCallback.
 * @param  term  Contexte terminal (ignoré si NULL)
 * @param  huart Handle UART ayant déclenché l'IT (comparé avec term->uart_debug)
 * @pre    Appelé exclusivement depuis le contexte IRQ HAL.
 * @post   term->cmd_ready == true si Enter saisi et cmd_len > 0.
 */
void LORAE5_TerminalRxCallback(LORAE5_Terminal *term, UART_HandleTypeDef *huart);

/**
 * @brief  Traite les commandes AT et affiche les réponses — appeler depuis while(1).
 * @param  term  Contexte terminal (ignoré si NULL ou incomplètement initialisé)
 * @note   Envoie la commande AT si cmd_ready, puis affiche toutes les lignes
 *         disponibles via LORAE5_PopLine().
 */
void LORAE5_TerminalTask(LORAE5_Terminal *term);

/* ── Diagnostic ──────────────────────────────────────────────────────────── */

/**
 * @brief  Convertit un code LORAE5_Status en chaîne lisible.
 * @param  status  Code à convertir
 * @retval Pointeur vers une chaîne littérale statique (ne pas libérer)
 * @note   Toujours disponible — pas de compilation conditionnelle.
 */
const char *LORAE5_StatusToString(LORAE5_Status status);

/**
 * @brief  Retourne le nombre de lignes RX perdues par overflow de queue.
 * @param  handle  Handle actif (NULL → retourne 0)
 * @retval Nombre d'overflows cumulés depuis Init ou dernier ClearOverflowCount (sature à 255)
 * @note   Un overflow signifie que la queue RX était pleine au moment de la réception.
 *         Augmenter LORAE5_LINE_QUEUE_DEPTH ou appeler LORAE5_Task() plus fréquemment.
 */
uint8_t LORAE5_GetOverflowCount(const LORAE5_Handle_t *handle);

/**
 * @brief  Remet à zéro le compteur d'overflows RX.
 * @param  handle  Handle actif (ignoré si NULL)
 */
void LORAE5_ClearOverflowCount(LORAE5_Handle_t *handle);

#ifdef __cplusplus
}
#endif

#endif /* STM32_LORAE5_H */
